sxp8046_asst#3/app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "picture", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "hiiiii"], ["picture", "1ad7768315844c83a0d5e424c28c1b03.jpg"], ["user_id", 1], ["created_at", "2016-05-01 02:42:44.756073"], ["updated_at", "2016-05-01 02:42:44.756073"]]
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save